Revit 2015 API
RebarBarTypeSet.Contains Method
Tests for the existence of a RebarBar type within the set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual bool Contains(
	RebarBarType item
)
Visual Basic
Public Overridable Function Contains ( _
	item As RebarBarType _
) As Boolean
Visual C++
public:
virtual bool Contains(
	RebarBarType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Structure.RebarBarType
The RebarBar type to be searched for.
Return Value
The Contains method returns True if the RebarBar type is within the set, otherwise False.
See Also
RebarBarTypeSet Class
Autodesk.Revit.DB.Structure Namespace